{
    "6878914f53642": {
        "title": "B.tech at Maya Devi University",
        "author": "Maya Devi University",
        "date": "2025-07-17",
        "content": "<h2>About<\/h2>\r\n<p><br>The School of Computer Applications at Maya Devi University is dedicated to shaping the future of technology by blending academic excellence with ethical responsibility. Anchored in a vision to be a leading center of innovation and knowledge, the School empowers students to become globally responsible digital leaders&mdash;equipped with technical expertise, creative problem-solving skills, and a strong moral compass.<\/p>\r\n<p>Our programs are designed to foster a dynamic learning environment that promotes innovation, critical thinking, and lifelong learning. We seamlessly integrate emerging technologies with core human values to ensure our graduates are not only proficient in cutting-edge tools but also driven by integrity, compassion, and a commitment to social good.<\/p>\r\n<p>Through a global perspective, hands-on experiences, and a focus on sustainability and inclusivity, the School prepares students to address real-world challenges and shape a better, tech-enabled future for all.<\/p>",
        "image": "admin\/uploads\/1757239563_ai.jpeg",
        "tags": [
            "education",
            "b.tech"
        ],
        "show_toc": true
    },
    "68bd4e5ad700b": {
        "title": "Agriculture at Maya devi University",
        "author": "Maya devi University",
        "date": "2025-09-07",
        "content": "<h2 class=\"text-custom\">About<\/h2>\r\n<p class=\"text-custom\">The School of Agriculture and Technology, Maya Devi University, Selaqui, Dehradun is a dynamic academic and research institution committed to advancing sustainable agricultural practices, technological innovation and rural development. The department of Agriculture was established in 2013 and school of Agriculture &amp; Technology in 2024. The school addresses the evolving challenges in food production, environmental sustainability and technological advancement and plays a vital role in training the next generation of professionals in agriculture and allied sciences. Rooted in a tradition of excellence and practical learning, the school offers programs that integrate modern scientific knowledge with hands-on experience in areas such as plant breeding, crop and soil science, horticultural sciences, agricultural engineering, food technology, microbiology, biochemistry, plant biotechnology and environmental management. The curriculum is designed to meet the needs of a rapidly changing agricultural landscape and to equip students with the skills to drive innovation and impact.<\/p>\r\n<p class=\"text-custom\">Our key focus areas are: Sustainable crop production, Soil health and fertility management, Climate-resilient agriculture, Farm machinery and automation, Water resource management, post-harvest handling and storage technologies, Waste-to-bioenergy conversion through microbial processes, Genetic improvement of crops, Genetic engineering of microbes for enhanced agricultural applications, Molecular biology and biotechnology applications, Bioinformatics and emerging technologies, Sustainable land use and conservation, Agroforestry and biodiversity, Climate-smart agriculture practices, Precision agriculture and data-driven farming, Farmer education and outreach programs, Community-based innovation and rural empowerment.<\/p>",
        "image": "admin\/uploads\/1757236826_agriculture.webp",
        "tags": [
            "agriculture",
            "education"
        ],
        "show_toc": true
    }
}